
# Parameters
nc: 1
ch: 4
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SA, [4]]
  - [-1, 1, Conv_maxpool, [64]] # 1-P2/4
  - [-1, 1, ShuffleNetV2, [128, 2]] # 2
  - [-1, 3, ShuffleNetV2, [128, 1]] # 3
  - [-1, 1, ShuffleNetV2, [256, 2]] # 4
  - [-1, 7, ShuffleNetV2, [256, 1]] # 5
  - [-1, 1, ShuffleNetV2, [512, 2]] # 6
  - [-1, 3, ShuffleNetV2, [512, 1]] # 7
  - [-1, 1, SPPF, [512, 5]] # 8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
